export const texts = [
  {
    nav: {
      main: 'Main',
      about: 'About Us',
      opportunities: 'Opportunities',
      contacts: 'Contacts',
    },
    header: {
      firstLine: 'aggregator for monetization of ',
      secondLine: 'creators',
      subtitle:
        'KMBINAT is the first domestic marketplace that brings together artisans / designers / artists',
    },
    online: {
      title: 'WE WORK ONLINE ONLY ',
      subtitle:
        'Our task is to simplify the search for unique works of art for connoisseurs of beauty as much as possible',
      third:
        'Also, we can help arrange a personal meeting between you and the buyer',
    },
    about: {
      title: 'WE UNITE A LARGE SEGMENT OF CREATIVE PEOPLE: ',
      title2: 'FROM BEGINNERS TO PROS',
      subtitle:
        'Here you can find a buyer for your work, build a portfolio and generally start a career as a commercially successful creator',
      guideline1: `Fill`,
      guideline1_2: `form`,
      guideline2: `create your`,
      guideline2_2: `online store`,
      guideline3: `Wait for`,
      guideline3_2: `clients!`,
      download: 'download guide',
    },

    opportunities: {
      title1: 'ЗАЧЕМ НАМ ЭТО?',
      title2: 'ПОЧЕМУ ТАК КРУТО?',
      subtitle1:
        'Наша задача — помочь творцам зарабатывать и иметь мотивацию создавать что-то новое',
      name: 'Кирилл Рождественский',
      position: 'multi-media художник / дизайнер',
      subtitlePos:
        'Творческому человеку чаще всего тяжело выводить свои продукты на продажу... Ему вообще не до этого! Нужен агрегатор.',
      title3: 'Прозрачность',
      subtitle3:
        'У креатора и ценителя имеются личные кабинеты с внутренними кошельками;',
      title4: 'Удобство ',
      subtitle4: 'Платформа собрана по свежим меркам  UI/UX дизайна;',
      title5: 'Искренность',
      subtitle5: 'Мы дадим каждому творцу раскрыться. Творец ≠ Маркетолог; ',
      questions: 'Есть вопрос? Пишите нам на почту:',
      answer: 'обязательно ответим!',
      contact1: 'Наши контакты',
      contact2: 'Подать заявку',
    },
    contact: {
      title1: 'СТАНЬ ЧАСТЬЮ',
      title2: 'ПРОЕКТА KMBINAT!',
      subtitle1:
        'Пожалуйста, заполните поля, прикрепите примеры работ и мы обязательно свяжемся! После того, как вы успешно пройдете модерацию - мы поможем с настройкой личного кабина и кошелька.',
      subtitle2: 'Время на рассмотрение: 2-3 рабочих дня. Спасибо!',
      form: {
        title: 'Заполните следующие поля:',
        name: 'Введите имя',
        phone: 'Введите мобильный номер',
        email: 'Введите Введите элетронную почту',
        message: 'Укажите название магазина и категорию товара',
        attach: 'Прикрепить работы',
        send: 'Отправить',
      },
    },
    footer: {
      title: '2022 KMBINAT. Все права защищены.',
      subtitle1:
        '“КMBINAT” является зарегистрированным товарным знаком, любое использование без письменного разрешения правообладателя запрещено.',
      subtitle2: 'Пользовательское соглашение.',
      subtitle3: 'Администратор объединения:',
    },
  },
  {
    nav: {
      main: 'Главная',
      about: 'О нас',
      opportunities: 'Возможности',
      contacts: 'Контакты',
    },
    header: {
      firstLine: 'агрегатор для монетизации ',
      secondLine: 'творцов',
      subtitle:
        'KMBINAT — первая отечественный маркетплейс, который объединил в себе ремесленников / дизайнеров / художников',
    },
    online: {
      title: 'МЫ РАБОТАЕМ ТОЛЬКО ОНЛАЙН ',
      subtitle:
        'Наша задача — максимально упростить поиск уникальных произведений искусства для ценителей прекрасного',
      third:
        'Также, мы можем помочь провести личную встречу между вами и покупателем',
    },
    about: {
      title: 'МЫ ОБЪЕДИНЯЕМ БОЛЬШОЙ СЕГМЕНТ ТВОРЧЕСКИХ ЛЮДЕЙ: ',
      title2: 'ОТ НОВИЧКОВ ДО ПРОФИ',
      subtitle:
        'Здесь вы сможете найти покупателя своих работ,  формировать портфолио  и в целом начать карьеру коммерчески успешного творца',
      guideline1: `Заполни`,
      guideline1_2: `Форму`,
      guideline2: `Создай свою`,
      guideline2_2: `онлайн витрину`,
      guideline3: `Ожидай новых`,
      guideline3_2: `клиентов!`,
      download: 'скачать гайд',
    },
    opportunities: {
      title1: 'ЗАЧЕМ НАМ ЭТО?',
      title2: 'ПОЧЕМУ ТАК КРУТО?',
      subtitle1:
        'Наша задача — помочь творцам зарабатывать и иметь мотивацию создавать что-то новое',
      name: 'Кирилл Рождественский',
      position: 'multi-media художник / дизайнер',
      subtitlePos:
        'Творческому человеку чаще всего тяжело выводить свои продукты на продажу... Ему вообще не до этого! Нужен агрегатор.',
      title3: 'Прозрачность',
      subtitle3:
        'У креатора и ценителя имеются личные кабинеты с внутренними кошельками;',
      title4: 'Удобство ',
      subtitle4: 'Платформа собрана по свежим меркам  UI/UX дизайна;',
      title5: 'Искренность',
      subtitle5: 'Мы дадим каждому творцу раскрыться. Творец ≠ Маркетолог; ',
      questions: 'Есть вопрос? Пишите нам на почту:',
      answer: 'обязательно ответим!',
      contact1: 'Наши контакты',
      contact2: 'Подать заявку',
    },
    contact: {
      title1: 'СТАНЬ ЧАСТЬЮ',
      title2: 'ПРОЕКТА KMBINAT!',
      subtitle1:
        'Пожалуйста, заполните поля, прикрепите примеры работ и мы обязательно свяжемся! После того, как вы успешно пройдете модерацию - мы поможем с настройкой личного кабина и кошелька.',
      subtitle2: 'Время на рассмотрение: 2-3 рабочих дня. Спасибо!',
      form: {
        title: 'Заполните следующие поля:',
        name: 'Введите имя',
        phone: 'Введите мобильный номер',
        email: 'Введите Введите элетронную почту',
        message: 'Укажите название магазина и категорию товара',
        attach: 'Прикрепить работы',
        send: 'Отправить',
      },
    },
    footer: {
      title: '2022 KMBINAT. Все права защищены.',
      subtitle1:
        '“КMBINAT” является зарегистрированным товарным знаком, любое использование без письменного разрешения правообладателя запрещено.',
      subtitle2: 'Пользовательское соглашение.',
      subtitle3: 'Администратор объединения:',
    },
  },
  {
    nav: {
      main: 'Басты',
      about: 'Біз туралы',
      opportunities: 'Құралдар',
      contacts: 'Байланыс',
    },
    header: {
      firstLine: 'жасаушының монетизациясының ',
      secondLine: 'агрегаторы',
      subtitle:
        'KMBINAT – қолөнершілерді/дизайнерлерді/суретшілерді біріктіретін алғашқы отандық нарық',
    },
    online: {
      title: 'МЫ РАБОТАЕМ ТОЛЬКО ОНЛАЙН ',
      subtitle:
        'Наша задача — максимально упростить поиск уникальных произведений искусства для ценителей прекрасного',
      third:
        'Также, мы можем помочь провести личную встречу между вами и покупателем',
    },
    about: {
      title: 'МЫ ОБЪЕДИНЯЕМ БОЛЬШОЙ СЕГМЕНТ ТВОРЧЕСКИХ ЛЮДЕЙ: ',
      title2: 'ОТ НОВИЧКОВ ДО ПРОФИ',
      subtitle:
        'Здесь вы сможете найти покупателя своих работ,  формировать портфолио  и в целом начать карьеру коммерчески успешного творца',
      guideline1: 'Заполни',
      guideline1_2: 'Форму',
      guideline2: 'Создай свою',
      guideline2_2: 'онлайн витрину',
      guideline3: 'Ожидай новых',
      guideline3_2: 'клиентов!',
      download: 'скачать гайд',
    },

    opportunities: {
      title1: 'ЗАЧЕМ НАМ ЭТО?',
      title2: 'ПОЧЕМУ ТАК КРУТО?',
      subtitle1:
        'Наша задача — помочь творцам зарабатывать и иметь мотивацию создавать что-то новое',
      name: 'Кирилл Рождественский',
      position: 'multi-media художник / дизайнер',
      subtitlePos:
        'Творческому человеку чаще всего тяжело выводить свои продукты на продажу... Ему вообще не до этого! Нужен агрегатор.',
      title3: 'Прозрачность',
      subtitle3:
        'У креатора и ценителя имеются личные кабинеты с внутренними кошельками;',
      title4: 'Удобство ',
      subtitle4: 'Платформа собрана по свежим меркам  UI/UX дизайна;',
      title5: 'Искренность',
      subtitle5: 'Мы дадим каждому творцу раскрыться. Творец ≠ Маркетолог; ',
      questions: 'Есть вопрос? Пишите нам на почту:',
      answer: 'обязательно ответим!',
      contact1: 'Наши контакты',
      contact2: 'Подать заявку',
    },
    contact: {
      title1: 'СТАНЬ ЧАСТЬЮ',
      title2: 'ПРОЕКТА KMBINAT!',
      subtitle1:
        'Пожалуйста, заполните поля, прикрепите примеры работ и мы обязательно свяжемся! После того, как вы успешно пройдете модерацию - мы поможем с настройкой личного кабина и кошелька.',
      subtitle2: 'Время на рассмотрение: 2-3 рабочих дня. Спасибо!',
      form: {
        title: 'Заполните следующие поля:',
        name: 'Введите имя',
        phone: 'Введите мобильный номер',
        email: 'Введите Введите элетронную почту',
        message: 'Укажите название магазина и категорию товара',
        attach: 'Прикрепить работы',
        send: 'Отправить',
      },
    },
    footer: {
      title: '2022 KMBINAT. Все права защищены.',
      subtitle1:
        '“КMBINAT” является зарегистрированным товарным знаком, любое использование без письменного разрешения правообладателя запрещено.',
      subtitle2: 'Пользовательское соглашение.',
      subtitle3: 'Администратор объединения:',
    },
  },
];
